# CreateCableTrayConnector Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConnectorElement..::..CreateCableTrayConnector Method
ConnectorElement Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CreateCableTrayConnector(Document, Reference) | Create a new cable tray ConnectorElement. |
| CreateCableTrayConnector(Document, Reference, Edge) | Create a new cable tray ConnectorElement. |

# See Also
ConnectorElement Class
ConnectorElement Members
Autodesk.Revit.DB Namespace